# Используем официальный образ Python 3.11
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями в рабочую директорию
COPY requirements.txt .

# Устанавливаем все зависимости, перечисленные в файле
# --no-cache-dir используется для уменьшения размера итогового образа
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы нашего проекта из текущей папки (где лежит Dockerfile)
# в рабочую директорию /app внутри контейнера
COPY . .

# Указываем команду, которая будет выполнена при запуске контейнера
CMD ["python", "bot.py"]